app/controllers/home_controller.rb

SELECT "sounds"."name" FROM "sounds" WHERE "sounds"."is_curated" = ? ORDER BY "sounds"."name" ASC  [["is_curated", 1]]
---
  def index
    @curated = Sound.where(is_curated: true).order(:name).pluck(:name)