app/controllers/sounds_controller.rb

  def index
    respond_to do |format|
      format.html { redirect_to root_path }
      format.json do
        curated = Sound.where(is_curated: true)
        if curated.exists?
---
SELECT "sounds".* FROM "sounds" WHERE "sounds"."is_curated" = ?  [["is_curated", 1]]
SELECT 1 AS one FROM "sounds" WHERE "sounds"."is_curated" = ? LIMIT ?  [["is_curated", 1], ["LIMIT", 1]]